Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#define PPS_SCOM0P3R_SCOM0P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM0P3R) SERCOM0/PAD3 Position */
#define PPS_SCOM0P3R_SCOM0P3_Msk              (_UINT32_(0xF) << PPS_SCOM0P3R_SCOM0P3_Pos)          /* (PPS_SCOM0P3R) SERCOM0/PAD3 Mask */
#define PPS_SCOM0P3R_SCOM0P3(value)           (PPS_SCOM0P3R_SCOM0P3_Msk & (_UINT32_(value) << PPS_SCOM0P3R_SCOM0P3_Pos)) /* Assigment of value for SCOM0P3 in the PPS_SCOM0P3R register */
#define   PPS_SCOM0P3R_SCOM0P3_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_SCOM0P3R) RPA9  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM0P3R) RPA3  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM0P3R) RPA7  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_SCOM0P3R) RPB4  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_SCOM0P3R) RPB8  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM0P3R) RPA6  */
#define   PPS_SCOM0P3R_SCOM0P3_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_SCOM0P3R) RPA10  */
#define   PPS_SCOM0P3R_SCOM0P3_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_SCOM0P3R) RPB7  */
#define   PPS_SCOM0P3R_SCOM0P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM0P3R) OFF  */
#define PPS_SCOM0P3R_SCOM0P3_RPA9             (PPS_SCOM0P3R_SCOM0P3_RPA9_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA9 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA3             (PPS_SCOM0P3R_SCOM0P3_RPA3_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA3 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA7             (PPS_SCOM0P3R_SCOM0P3_RPA7_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA7 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB4             (PPS_SCOM0P3R_SCOM0P3_RPB4_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB4 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB8             (PPS_SCOM0P3R_SCOM0P3_RPB8_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB8 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA6             (PPS_SCOM0P3R_SCOM0P3_RPA6_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA6 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPA10            (PPS_SCOM0P3R_SCOM0P3_RPA10_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPA10 Position  */
#define PPS_SCOM0P3R_SCOM0P3_RPB7             (PPS_SCOM0P3R_SCOM0P3_RPB7_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) RPB7 Position  */
#define PPS_SCOM0P3R_SCOM0P3_OFF              (PPS_SCOM0P3R_SCOM0P3_OFF_Val << PPS_SCOM0P3R_SCOM0P3_Pos) /* (PPS_SCOM0P3R) OFF Position  */
#define PPS_SCOM0P3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM0P3R) Register Mask  */


/* -------- PPS_SCOM1P0R : (PPS Offset: 0x50) (R/W 32)  -------- */
#define PPS_SCOM1P0R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P0R)   Reset Value */

#define PPS_SCOM1P0R_SCOM1P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P0R) SERCOM1/PAD0 Position */
#define PPS_SCOM1P0R_SCOM1P0_Msk              (_UINT32_(0xF) << PPS_SCOM1P0R_SCOM1P0_Pos)          /* (PPS_SCOM1P0R) SERCOM1/PAD0 Mask */
#define PPS_SCOM1P0R_SCOM1P0(value)           (PPS_SCOM1P0R_SCOM1P0_Msk & (_UINT32_(value) << PPS_SCOM1P0R_SCOM1P0_Pos)) /* Assigment of value for SCOM1P0 in the PPS_SCOM1P0R register */
#define   PPS_SCOM1P0R_SCOM1P0_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P0R) RPA5  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P0R) RPA9  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P0R) RPB6  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P0R) RPA4  */
#define   PPS_SCOM1P0R_SCOM1P0_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P0R) RPA8  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P0R) RPB5  */
#define   PPS_SCOM1P0R_SCOM1P0_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P0R) RPB9  */
#define   PPS_SCOM1P0R_SCOM1P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P0R) OFF  */
#define PPS_SCOM1P0R_SCOM1P0_RPA5             (PPS_SCOM1P0R_SCOM1P0_RPA5_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA5 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA9             (PPS_SCOM1P0R_SCOM1P0_RPA9_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA9 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB6             (PPS_SCOM1P0R_SCOM1P0_RPB6_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB6 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA4             (PPS_SCOM1P0R_SCOM1P0_RPA4_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA4 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPA8             (PPS_SCOM1P0R_SCOM1P0_RPA8_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPA8 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB5             (PPS_SCOM1P0R_SCOM1P0_RPB5_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB5 Position  */
#define PPS_SCOM1P0R_SCOM1P0_RPB9             (PPS_SCOM1P0R_SCOM1P0_RPB9_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) RPB9 Position  */
#define PPS_SCOM1P0R_SCOM1P0_OFF              (PPS_SCOM1P0R_SCOM1P0_OFF_Val << PPS_SCOM1P0R_SCOM1P0_Pos) /* (PPS_SCOM1P0R) OFF Position  */
#define PPS_SCOM1P0R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P0R) Register Mask  */


/* -------- PPS_SCOM1P1R : (PPS Offset: 0x54) (R/W 32)  -------- */
#define PPS_SCOM1P1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P1R)   Reset Value */

#define PPS_SCOM1P1R_SCOM1P1_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P1R) SERCOM1/PAD1 Position */
#define PPS_SCOM1P1R_SCOM1P1_Msk              (_UINT32_(0xF) << PPS_SCOM1P1R_SCOM1P1_Pos)          /* (PPS_SCOM1P1R) SERCOM1/PAD1 Mask */
#define PPS_SCOM1P1R_SCOM1P1(value)           (PPS_SCOM1P1R_SCOM1P1_Msk & (_UINT32_(value) << PPS_SCOM1P1R_SCOM1P1_Pos)) /* Assigment of value for SCOM1P1 in the PPS_SCOM1P1R register */
#define   PPS_SCOM1P1R_SCOM1P1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P1R) RPA6  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_SCOM1P1R) RPA10  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P1R) RPB7  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P1R) RPA5  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P1R) RPA9  */
#define   PPS_SCOM1P1R_SCOM1P1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P1R) RPB6  */
#define   PPS_SCOM1P1R_SCOM1P1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_SCOM1P1R) RPA8  */
#define   PPS_SCOM1P1R_SCOM1P1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P1R) OFF  */
#define PPS_SCOM1P1R_SCOM1P1_RPA6             (PPS_SCOM1P1R_SCOM1P1_RPA6_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA6 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA10            (PPS_SCOM1P1R_SCOM1P1_RPA10_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA10 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB7             (PPS_SCOM1P1R_SCOM1P1_RPB7_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB7 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA5             (PPS_SCOM1P1R_SCOM1P1_RPA5_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA5 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA9             (PPS_SCOM1P1R_SCOM1P1_RPA9_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA9 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPB6             (PPS_SCOM1P1R_SCOM1P1_RPB6_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPB6 Position  */
#define PPS_SCOM1P1R_SCOM1P1_RPA8             (PPS_SCOM1P1R_SCOM1P1_RPA8_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) RPA8 Position  */
#define PPS_SCOM1P1R_SCOM1P1_OFF              (PPS_SCOM1P1R_SCOM1P1_OFF_Val << PPS_SCOM1P1R_SCOM1P1_Pos) /* (PPS_SCOM1P1R) OFF Position  */
#define PPS_SCOM1P1R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P1R) Register Mask  */


/* -------- PPS_SCOM1P2R : (PPS Offset: 0x58) (R/W 32)  -------- */
#define PPS_SCOM1P2R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P2R)   Reset Value */

#define PPS_SCOM1P2R_SCOM1P2_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P2R) SERCOM1/PAD2 Position */
#define PPS_SCOM1P2R_SCOM1P2_Msk              (_UINT32_(0xF) << PPS_SCOM1P2R_SCOM1P2_Pos)          /* (PPS_SCOM1P2R) SERCOM1/PAD2 Mask */
#define PPS_SCOM1P2R_SCOM1P2(value)           (PPS_SCOM1P2R_SCOM1P2_Msk & (_UINT32_(value) << PPS_SCOM1P2R_SCOM1P2_Pos)) /* Assigment of value for SCOM1P2 in the PPS_SCOM1P2R register */
#define   PPS_SCOM1P2R_SCOM1P2_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_SCOM1P2R) RPA9  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P2R) RPA3  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P2R) RPA7  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P2R) RPB4  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_SCOM1P2R) RPB8  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P2R) RPA6  */
#define   PPS_SCOM1P2R_SCOM1P2_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_SCOM1P2R) RPA10  */
#define   PPS_SCOM1P2R_SCOM1P2_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P2R) RPB7  */
#define   PPS_SCOM1P2R_SCOM1P2_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P2R) OFF  */
#define PPS_SCOM1P2R_SCOM1P2_RPA9             (PPS_SCOM1P2R_SCOM1P2_RPA9_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA9 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA3             (PPS_SCOM1P2R_SCOM1P2_RPA3_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA3 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA7             (PPS_SCOM1P2R_SCOM1P2_RPA7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB4             (PPS_SCOM1P2R_SCOM1P2_RPB4_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB4 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB8             (PPS_SCOM1P2R_SCOM1P2_RPB8_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB8 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA6             (PPS_SCOM1P2R_SCOM1P2_RPA6_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA6 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPA10            (PPS_SCOM1P2R_SCOM1P2_RPA10_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPA10 Position  */
#define PPS_SCOM1P2R_SCOM1P2_RPB7             (PPS_SCOM1P2R_SCOM1P2_RPB7_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) RPB7 Position  */
#define PPS_SCOM1P2R_SCOM1P2_OFF              (PPS_SCOM1P2R_SCOM1P2_OFF_Val << PPS_SCOM1P2R_SCOM1P2_Pos) /* (PPS_SCOM1P2R) OFF Position  */
#define PPS_SCOM1P2R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P2R) Register Mask  */


/* -------- PPS_SCOM1P3R : (PPS Offset: 0x5C) (R/W 32)  -------- */
#define PPS_SCOM1P3R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_SCOM1P3R)   Reset Value */

