Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#define PPS_SCOM1P3R_SCOM1P3_Pos              _UINT32_(0)                                          /* (PPS_SCOM1P3R) SERCOM1/PAD3 Position */
#define PPS_SCOM1P3R_SCOM1P3_Msk              (_UINT32_(0xF) << PPS_SCOM1P3R_SCOM1P3_Pos)          /* (PPS_SCOM1P3R) SERCOM1/PAD3 Mask */
#define PPS_SCOM1P3R_SCOM1P3(value)           (PPS_SCOM1P3R_SCOM1P3_Msk & (_UINT32_(value) << PPS_SCOM1P3R_SCOM1P3_Pos)) /* Assigment of value for SCOM1P3 in the PPS_SCOM1P3R register */
#define   PPS_SCOM1P3R_SCOM1P3_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_SCOM1P3R) RPA4  */
#define   PPS_SCOM1P3R_SCOM1P3_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_SCOM1P3R) RPA8  */
#define   PPS_SCOM1P3R_SCOM1P3_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_SCOM1P3R) RPB5  */
#define   PPS_SCOM1P3R_SCOM1P3_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_SCOM1P3R) RPB9  */
#define   PPS_SCOM1P3R_SCOM1P3_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_SCOM1P3R) RPA3  */
#define   PPS_SCOM1P3R_SCOM1P3_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_SCOM1P3R) RPA7  */
#define   PPS_SCOM1P3R_SCOM1P3_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_SCOM1P3R) RPB4  */
#define   PPS_SCOM1P3R_SCOM1P3_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_SCOM1P3R) RPB8  */
#define   PPS_SCOM1P3R_SCOM1P3_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM1P3R) OFF  */
#define PPS_SCOM1P3R_SCOM1P3_RPA4             (PPS_SCOM1P3R_SCOM1P3_RPA4_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPA4 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPA8             (PPS_SCOM1P3R_SCOM1P3_RPA8_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPA8 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPB5             (PPS_SCOM1P3R_SCOM1P3_RPB5_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPB5 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPB9             (PPS_SCOM1P3R_SCOM1P3_RPB9_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPB9 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPA3             (PPS_SCOM1P3R_SCOM1P3_RPA3_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPA3 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPA7             (PPS_SCOM1P3R_SCOM1P3_RPA7_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPA7 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPB4             (PPS_SCOM1P3R_SCOM1P3_RPB4_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPB4 Position  */
#define PPS_SCOM1P3R_SCOM1P3_RPB8             (PPS_SCOM1P3R_SCOM1P3_RPB8_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) RPB8 Position  */
#define PPS_SCOM1P3R_SCOM1P3_OFF              (PPS_SCOM1P3R_SCOM1P3_OFF_Val << PPS_SCOM1P3R_SCOM1P3_Pos) /* (PPS_SCOM1P3R) OFF Position  */
#define PPS_SCOM1P3R_Msk                      _UINT32_(0x0000000F)                                 /* (PPS_SCOM1P3R) Register Mask  */


/* -------- PPS_QSCKR : (PPS Offset: 0x80) (R/W 32)  -------- */
#define PPS_QSCKR_RESETVALUE                  _UINT32_(0x00)                                       /*  (PPS_QSCKR)   Reset Value */

#define PPS_QSCKR_QSCK_Pos                    _UINT32_(0)                                          /* (PPS_QSCKR) QSPI/SCK Position */
#define PPS_QSCKR_QSCK_Msk                    (_UINT32_(0xF) << PPS_QSCKR_QSCK_Pos)                /* (PPS_QSCKR) QSPI/SCK Mask */
#define PPS_QSCKR_QSCK(value)                 (PPS_QSCKR_QSCK_Msk & (_UINT32_(value) << PPS_QSCKR_QSCK_Pos)) /* Assigment of value for QSCK in the PPS_QSCKR register */
#define   PPS_QSCKR_QSCK_RPA9_Val             _UINT32_(0xF)                                        /* (PPS_QSCKR) RPA9  */
#define   PPS_QSCKR_QSCK_RPA3_Val             _UINT32_(0x1)                                        /* (PPS_QSCKR) RPA3  */
#define   PPS_QSCKR_QSCK_RPA7_Val             _UINT32_(0x2)                                        /* (PPS_QSCKR) RPA7  */
#define   PPS_QSCKR_QSCK_RPB4_Val             _UINT32_(0x5)                                        /* (PPS_QSCKR) RPB4  */
#define   PPS_QSCKR_QSCK_RPB8_Val             _UINT32_(0x6)                                        /* (PPS_QSCKR) RPB8  */
#define   PPS_QSCKR_QSCK_RPA6_Val             _UINT32_(0x9)                                        /* (PPS_QSCKR) RPA6  */
#define   PPS_QSCKR_QSCK_RPA10_Val            _UINT32_(0xA)                                        /* (PPS_QSCKR) RPA10  */
#define   PPS_QSCKR_QSCK_RPB7_Val             _UINT32_(0xD)                                        /* (PPS_QSCKR) RPB7  */
#define   PPS_QSCKR_QSCK_OFF_Val              _UINT32_(0x0)                                        /* (PPS_QSCKR) OFF  */
#define PPS_QSCKR_QSCK_RPA9                   (PPS_QSCKR_QSCK_RPA9_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA9 Position  */
#define PPS_QSCKR_QSCK_RPA3                   (PPS_QSCKR_QSCK_RPA3_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA3 Position  */
#define PPS_QSCKR_QSCK_RPA7                   (PPS_QSCKR_QSCK_RPA7_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA7 Position  */
#define PPS_QSCKR_QSCK_RPB4                   (PPS_QSCKR_QSCK_RPB4_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB4 Position  */
#define PPS_QSCKR_QSCK_RPB8                   (PPS_QSCKR_QSCK_RPB8_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB8 Position  */
#define PPS_QSCKR_QSCK_RPA6                   (PPS_QSCKR_QSCK_RPA6_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPA6 Position  */
#define PPS_QSCKR_QSCK_RPA10                  (PPS_QSCKR_QSCK_RPA10_Val << PPS_QSCKR_QSCK_Pos)     /* (PPS_QSCKR) RPA10 Position  */
#define PPS_QSCKR_QSCK_RPB7                   (PPS_QSCKR_QSCK_RPB7_Val << PPS_QSCKR_QSCK_Pos)      /* (PPS_QSCKR) RPB7 Position  */
#define PPS_QSCKR_QSCK_OFF                    (PPS_QSCKR_QSCK_OFF_Val << PPS_QSCKR_QSCK_Pos)       /* (PPS_QSCKR) OFF Position  */
#define PPS_QSCKR_Msk                         _UINT32_(0x0000000F)                                 /* (PPS_QSCKR) Register Mask  */


