Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
/* -------- PPS_QD0R : (PPS Offset: 0x84) (R/W 32)  -------- */
#define PPS_QD0R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD0R)   Reset Value */

#define PPS_QD0R_QD0_Pos                      _UINT32_(0)                                          /* (PPS_QD0R) QSPI/DATA0 Position */
#define PPS_QD0R_QD0_Msk                      (_UINT32_(0xF) << PPS_QD0R_QD0_Pos)                  /* (PPS_QD0R) QSPI/DATA0 Mask */
#define PPS_QD0R_QD0(value)                   (PPS_QD0R_QD0_Msk & (_UINT32_(value) << PPS_QD0R_QD0_Pos)) /* Assigment of value for QD0 in the PPS_QD0R register */
#define   PPS_QD0R_QD0_RPA6_Val               _UINT32_(0x1)                                        /* (PPS_QD0R) RPA6  */
#define   PPS_QD0R_QD0_RPA10_Val              _UINT32_(0x2)                                        /* (PPS_QD0R) RPA10  */
#define   PPS_QD0R_QD0_RPB7_Val               _UINT32_(0x5)                                        /* (PPS_QD0R) RPB7  */
#define   PPS_QD0R_QD0_RPA5_Val               _UINT32_(0x8)                                        /* (PPS_QD0R) RPA5  */
#define   PPS_QD0R_QD0_RPA9_Val               _UINT32_(0x9)                                        /* (PPS_QD0R) RPA9  */
#define   PPS_QD0R_QD0_RPB6_Val               _UINT32_(0xC)                                        /* (PPS_QD0R) RPB6  */
#define   PPS_QD0R_QD0_RPA8_Val               _UINT32_(0xE)                                        /* (PPS_QD0R) RPA8  */
#define   PPS_QD0R_QD0_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD0R) OFF  */
#define PPS_QD0R_QD0_RPA6                     (PPS_QD0R_QD0_RPA6_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA6 Position  */
#define PPS_QD0R_QD0_RPA10                    (PPS_QD0R_QD0_RPA10_Val << PPS_QD0R_QD0_Pos)         /* (PPS_QD0R) RPA10 Position  */
#define PPS_QD0R_QD0_RPB7                     (PPS_QD0R_QD0_RPB7_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB7 Position  */
#define PPS_QD0R_QD0_RPA5                     (PPS_QD0R_QD0_RPA5_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA5 Position  */
#define PPS_QD0R_QD0_RPA9                     (PPS_QD0R_QD0_RPA9_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA9 Position  */
#define PPS_QD0R_QD0_RPB6                     (PPS_QD0R_QD0_RPB6_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPB6 Position  */
#define PPS_QD0R_QD0_RPA8                     (PPS_QD0R_QD0_RPA8_Val << PPS_QD0R_QD0_Pos)          /* (PPS_QD0R) RPA8 Position  */
#define PPS_QD0R_QD0_OFF                      (PPS_QD0R_QD0_OFF_Val << PPS_QD0R_QD0_Pos)           /* (PPS_QD0R) OFF Position  */
#define PPS_QD0R_Msk                          _UINT32_(0x0000000F)                                 /* (PPS_QD0R) Register Mask  */


/* -------- PPS_QD1R : (PPS Offset: 0x88) (R/W 32)  -------- */
#define PPS_QD1R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD1R)   Reset Value */

#define PPS_QD1R_QD1_Pos                      _UINT32_(0)                                          /* (PPS_QD1R) QSPI/DATA1 Position */
#define PPS_QD1R_QD1_Msk                      (_UINT32_(0xF) << PPS_QD1R_QD1_Pos)                  /* (PPS_QD1R) QSPI/DATA1 Mask */
#define PPS_QD1R_QD1(value)                   (PPS_QD1R_QD1_Msk & (_UINT32_(value) << PPS_QD1R_QD1_Pos)) /* Assigment of value for QD1 in the PPS_QD1R register */
#define   PPS_QD1R_QD1_RPA9_Val               _UINT32_(0xF)                                        /* (PPS_QD1R) RPA9  */
#define   PPS_QD1R_QD1_RPA3_Val               _UINT32_(0x1)                                        /* (PPS_QD1R) RPA3  */
#define   PPS_QD1R_QD1_RPA7_Val               _UINT32_(0x2)                                        /* (PPS_QD1R) RPA7  */
#define   PPS_QD1R_QD1_RPB4_Val               _UINT32_(0x5)                                        /* (PPS_QD1R) RPB4  */
#define   PPS_QD1R_QD1_RPB8_Val               _UINT32_(0x6)                                        /* (PPS_QD1R) RPB8  */
#define   PPS_QD1R_QD1_RPA6_Val               _UINT32_(0x9)                                        /* (PPS_QD1R) RPA6  */
#define   PPS_QD1R_QD1_RPA10_Val              _UINT32_(0xA)                                        /* (PPS_QD1R) RPA10  */
#define   PPS_QD1R_QD1_RPB7_Val               _UINT32_(0xD)                                        /* (PPS_QD1R) RPB7  */
#define   PPS_QD1R_QD1_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD1R) OFF  */
#define PPS_QD1R_QD1_RPA9                     (PPS_QD1R_QD1_RPA9_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA9 Position  */
#define PPS_QD1R_QD1_RPA3                     (PPS_QD1R_QD1_RPA3_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA3 Position  */
#define PPS_QD1R_QD1_RPA7                     (PPS_QD1R_QD1_RPA7_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA7 Position  */
#define PPS_QD1R_QD1_RPB4                     (PPS_QD1R_QD1_RPB4_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB4 Position  */
#define PPS_QD1R_QD1_RPB8                     (PPS_QD1R_QD1_RPB8_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB8 Position  */
#define PPS_QD1R_QD1_RPA6                     (PPS_QD1R_QD1_RPA6_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA6 Position  */
#define PPS_QD1R_QD1_RPA10                    (PPS_QD1R_QD1_RPA10_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPA10 Position  */
#define PPS_QD1R_QD1_RPB7                     (PPS_QD1R_QD1_RPB7_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB7 Position  */
#define PPS_QD1R_QD1_OFF                      (PPS_QD1R_QD1_OFF_Val << PPS_QD1R_QD1_Pos)           /* (PPS_QD1R) OFF Position  */
#define PPS_QD1R_Msk                          _UINT32_(0x0000000F)                                 /* (PPS_QD1R) Register Mask  */


/* -------- PPS_QD2R : (PPS Offset: 0x8C) (R/W 32)  -------- */
#define PPS_QD2R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD2R)   Reset Value */

#define PPS_QD2R_QD2_Pos                      _UINT32_(0)                                          /* (PPS_QD2R) QSPI/DATA2 Position */
#define PPS_QD2R_QD2_Msk                      (_UINT32_(0xF) << PPS_QD2R_QD2_Pos)                  /* (PPS_QD2R) QSPI/DATA2 Mask */
#define PPS_QD2R_QD2(value)                   (PPS_QD2R_QD2_Msk & (_UINT32_(value) << PPS_QD2R_QD2_Pos)) /* Assigment of value for QD2 in the PPS_QD2R register */
#define   PPS_QD2R_QD2_RPA4_Val               _UINT32_(0x1)                                        /* (PPS_QD2R) RPA4  */
#define   PPS_QD2R_QD2_RPA8_Val               _UINT32_(0x2)                                        /* (PPS_QD2R) RPA8  */
#define   PPS_QD2R_QD2_RPB5_Val               _UINT32_(0x5)                                        /* (PPS_QD2R) RPB5  */
#define   PPS_QD2R_QD2_RPB9_Val               _UINT32_(0x6)                                        /* (PPS_QD2R) RPB9  */
#define   PPS_QD2R_QD2_RPA3_Val               _UINT32_(0x8)                                        /* (PPS_QD2R) RPA3  */
#define   PPS_QD2R_QD2_RPA7_Val               _UINT32_(0x9)                                        /* (PPS_QD2R) RPA7  */
#define   PPS_QD2R_QD2_RPB4_Val               _UINT32_(0xC)                                        /* (PPS_QD2R) RPB4  */
#define   PPS_QD2R_QD2_RPB8_Val               _UINT32_(0xD)                                        /* (PPS_QD2R) RPB8  */
#define   PPS_QD2R_QD2_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD2R) OFF  */
#define PPS_QD2R_QD2_RPA4                     (PPS_QD2R_QD2_RPA4_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA4 Position  */
#define PPS_QD2R_QD2_RPA8                     (PPS_QD2R_QD2_RPA8_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA8 Position  */
#define PPS_QD2R_QD2_RPB5                     (PPS_QD2R_QD2_RPB5_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB5 Position  */
#define PPS_QD2R_QD2_RPB9                     (PPS_QD2R_QD2_RPB9_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB9 Position  */
#define PPS_QD2R_QD2_RPA3                     (PPS_QD2R_QD2_RPA3_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA3 Position  */
#define PPS_QD2R_QD2_RPA7                     (PPS_QD2R_QD2_RPA7_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPA7 Position  */
#define PPS_QD2R_QD2_RPB4                     (PPS_QD2R_QD2_RPB4_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB4 Position  */
#define PPS_QD2R_QD2_RPB8                     (PPS_QD2R_QD2_RPB8_Val << PPS_QD2R_QD2_Pos)          /* (PPS_QD2R) RPB8 Position  */
#define PPS_QD2R_QD2_OFF                      (PPS_QD2R_QD2_OFF_Val << PPS_QD2R_QD2_Pos)           /* (PPS_QD2R) OFF Position  */
#define PPS_QD2R_Msk                          _UINT32_(0x0000000F)                                 /* (PPS_QD2R) Register Mask  */


