Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#define PPS_CCLIN4R_CCLIN4_Pos                _UINT32_(0)                                          /* (PPS_CCLIN4R) CCL/IN4 Position */
#define PPS_CCLIN4R_CCLIN4_Msk                (_UINT32_(0xF) << PPS_CCLIN4R_CCLIN4_Pos)            /* (PPS_CCLIN4R) CCL/IN4 Mask */
#define PPS_CCLIN4R_CCLIN4(value)             (PPS_CCLIN4R_CCLIN4_Msk & (_UINT32_(value) << PPS_CCLIN4R_CCLIN4_Pos)) /* Assigment of value for CCLIN4 in the PPS_CCLIN4R register */
#define   PPS_CCLIN4R_CCLIN4_RPA4_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN4R) RPA4  */
#define   PPS_CCLIN4R_CCLIN4_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN4R) RPA8  */
#define   PPS_CCLIN4R_CCLIN4_RPB5_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN4R) RPB5  */
#define   PPS_CCLIN4R_CCLIN4_RPB9_Val         _UINT32_(0x6)                                        /* (PPS_CCLIN4R) RPB9  */
#define   PPS_CCLIN4R_CCLIN4_RPA3_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN4R) RPA3  */
#define   PPS_CCLIN4R_CCLIN4_RPA7_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN4R) RPA7  */
#define   PPS_CCLIN4R_CCLIN4_RPB4_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN4R) RPB4  */
#define   PPS_CCLIN4R_CCLIN4_RPB8_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN4R) RPB8  */
#define   PPS_CCLIN4R_CCLIN4_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN4R) OFF  */
#define PPS_CCLIN4R_CCLIN4_RPA4               (PPS_CCLIN4R_CCLIN4_RPA4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA4 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA8               (PPS_CCLIN4R_CCLIN4_RPA8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA8 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB5               (PPS_CCLIN4R_CCLIN4_RPB5_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB5 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB9               (PPS_CCLIN4R_CCLIN4_RPB9_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB9 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA3               (PPS_CCLIN4R_CCLIN4_RPA3_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA3 Position  */
#define PPS_CCLIN4R_CCLIN4_RPA7               (PPS_CCLIN4R_CCLIN4_RPA7_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPA7 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB4               (PPS_CCLIN4R_CCLIN4_RPB4_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB4 Position  */
#define PPS_CCLIN4R_CCLIN4_RPB8               (PPS_CCLIN4R_CCLIN4_RPB8_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) RPB8 Position  */
#define PPS_CCLIN4R_CCLIN4_OFF                (PPS_CCLIN4R_CCLIN4_OFF_Val << PPS_CCLIN4R_CCLIN4_Pos) /* (PPS_CCLIN4R) OFF Position  */
#define PPS_CCLIN4R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN4R) Register Mask  */


/* -------- PPS_CCLIN5R : (PPS Offset: 0xAC) (R/W 32)  -------- */
#define PPS_CCLIN5R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN5R)   Reset Value */

#define PPS_CCLIN5R_CCLIN5_Pos                _UINT32_(0)                                          /* (PPS_CCLIN5R) CCL/IN5 Position */
#define PPS_CCLIN5R_CCLIN5_Msk                (_UINT32_(0xF) << PPS_CCLIN5R_CCLIN5_Pos)            /* (PPS_CCLIN5R) CCL/IN5 Mask */
#define PPS_CCLIN5R_CCLIN5(value)             (PPS_CCLIN5R_CCLIN5_Msk & (_UINT32_(value) << PPS_CCLIN5R_CCLIN5_Pos)) /* Assigment of value for CCLIN5 in the PPS_CCLIN5R register */
#define   PPS_CCLIN5R_CCLIN5_RPA5_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN5R) RPA5  */
#define   PPS_CCLIN5R_CCLIN5_RPA9_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN5R) RPA9  */
#define   PPS_CCLIN5R_CCLIN5_RPB6_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN5R) RPB6  */
#define   PPS_CCLIN5R_CCLIN5_RPA4_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN5R) RPA4  */
#define   PPS_CCLIN5R_CCLIN5_RPA8_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN5R) RPA8  */
#define   PPS_CCLIN5R_CCLIN5_RPB5_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN5R) RPB5  */
#define   PPS_CCLIN5R_CCLIN5_RPB9_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN5R) RPB9  */
#define   PPS_CCLIN5R_CCLIN5_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN5R) OFF  */
#define PPS_CCLIN5R_CCLIN5_RPA5               (PPS_CCLIN5R_CCLIN5_RPA5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA9               (PPS_CCLIN5R_CCLIN5_RPA9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA9 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB6               (PPS_CCLIN5R_CCLIN5_RPB6_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB6 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA4               (PPS_CCLIN5R_CCLIN5_RPA4_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA4 Position  */
#define PPS_CCLIN5R_CCLIN5_RPA8               (PPS_CCLIN5R_CCLIN5_RPA8_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPA8 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB5               (PPS_CCLIN5R_CCLIN5_RPB5_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB5 Position  */
#define PPS_CCLIN5R_CCLIN5_RPB9               (PPS_CCLIN5R_CCLIN5_RPB9_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) RPB9 Position  */
#define PPS_CCLIN5R_CCLIN5_OFF                (PPS_CCLIN5R_CCLIN5_OFF_Val << PPS_CCLIN5R_CCLIN5_Pos) /* (PPS_CCLIN5R) OFF Position  */
#define PPS_CCLIN5R_Msk                       _UINT32_(0x0000000F)                                 /* (PPS_CCLIN5R) Register Mask  */


/* -------- PPS_TC0WO0G1R : (PPS Offset: 0xB0) (R/W 32)  -------- */
#define PPS_TC0WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO0G1R)   Reset Value */

#define PPS_TC0WO0G1R_TC0WO0_Pos              _UINT32_(0)                                          /* (PPS_TC0WO0G1R) TC0/WO0G1 Position */
#define PPS_TC0WO0G1R_TC0WO0_Msk              (_UINT32_(0xF) << PPS_TC0WO0G1R_TC0WO0_Pos)          /* (PPS_TC0WO0G1R) TC0/WO0G1 Mask */
#define PPS_TC0WO0G1R_TC0WO0(value)           (PPS_TC0WO0G1R_TC0WO0_Msk & (_UINT32_(value) << PPS_TC0WO0G1R_TC0WO0_Pos)) /* Assigment of value for TC0WO0 in the PPS_TC0WO0G1R register */
#define   PPS_TC0WO0G1R_TC0WO0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_TC0WO0G1R) RPA9  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO0G1R) RPA3  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO0G1R) RPA7  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO0G1R) RPB4  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_TC0WO0G1R) RPB8  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO0G1R) RPA6  */
#define   PPS_TC0WO0G1R_TC0WO0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_TC0WO0G1R) RPA10  */
#define   PPS_TC0WO0G1R_TC0WO0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO0G1R) RPB7  */
#define   PPS_TC0WO0G1R_TC0WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO0G1R) OFF  */
#define PPS_TC0WO0G1R_TC0WO0_RPA9             (PPS_TC0WO0G1R_TC0WO0_RPA9_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA9 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA3             (PPS_TC0WO0G1R_TC0WO0_RPA3_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA3 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA7             (PPS_TC0WO0G1R_TC0WO0_RPA7_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA7 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB4             (PPS_TC0WO0G1R_TC0WO0_RPB4_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB4 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB8             (PPS_TC0WO0G1R_TC0WO0_RPB8_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB8 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA6             (PPS_TC0WO0G1R_TC0WO0_RPA6_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA6 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPA10            (PPS_TC0WO0G1R_TC0WO0_RPA10_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPA10 Position  */
#define PPS_TC0WO0G1R_TC0WO0_RPB7             (PPS_TC0WO0G1R_TC0WO0_RPB7_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) RPB7 Position  */
#define PPS_TC0WO0G1R_TC0WO0_OFF              (PPS_TC0WO0G1R_TC0WO0_OFF_Val << PPS_TC0WO0G1R_TC0WO0_Pos) /* (PPS_TC0WO0G1R) OFF Position  */
#define PPS_TC0WO0G1R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO0G1R) Register Mask  */


/* -------- PPS_TC0WO0G2R : (PPS Offset: 0xB4) (R/W 32)  -------- */
#define PPS_TC0WO0G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO0G2R)   Reset Value */

#define PPS_TC0WO0G2R_TC0WO0_Pos              _UINT32_(0)                                          /* (PPS_TC0WO0G2R) TC0/WO0G2 Position */
#define PPS_TC0WO0G2R_TC0WO0_Msk              (_UINT32_(0xF) << PPS_TC0WO0G2R_TC0WO0_Pos)          /* (PPS_TC0WO0G2R) TC0/WO0G2 Mask */
#define PPS_TC0WO0G2R_TC0WO0(value)           (PPS_TC0WO0G2R_TC0WO0_Msk & (_UINT32_(value) << PPS_TC0WO0G2R_TC0WO0_Pos)) /* Assigment of value for TC0WO0 in the PPS_TC0WO0G2R register */
#define   PPS_TC0WO0G2R_TC0WO0_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO0G2R) RPA4  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO0G2R) RPA8  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO0G2R) RPB5  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_TC0WO0G2R) RPB9  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO0G2R) RPA3  */
#define   PPS_TC0WO0G2R_TC0WO0_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO0G2R) RPA7  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO0G2R) RPB4  */
#define   PPS_TC0WO0G2R_TC0WO0_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO0G2R) RPB8  */
#define   PPS_TC0WO0G2R_TC0WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO0G2R) OFF  */
#define PPS_TC0WO0G2R_TC0WO0_RPA4             (PPS_TC0WO0G2R_TC0WO0_RPA4_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA4 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA8             (PPS_TC0WO0G2R_TC0WO0_RPA8_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA8 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB5             (PPS_TC0WO0G2R_TC0WO0_RPB5_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB5 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB9             (PPS_TC0WO0G2R_TC0WO0_RPB9_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB9 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA3             (PPS_TC0WO0G2R_TC0WO0_RPA3_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA3 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPA7             (PPS_TC0WO0G2R_TC0WO0_RPA7_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPA7 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB4             (PPS_TC0WO0G2R_TC0WO0_RPB4_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB4 Position  */
#define PPS_TC0WO0G2R_TC0WO0_RPB8             (PPS_TC0WO0G2R_TC0WO0_RPB8_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) RPB8 Position  */
#define PPS_TC0WO0G2R_TC0WO0_OFF              (PPS_TC0WO0G2R_TC0WO0_OFF_Val << PPS_TC0WO0G2R_TC0WO0_Pos) /* (PPS_TC0WO0G2R) OFF Position  */
#define PPS_TC0WO0G2R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO0G2R) Register Mask  */


/* -------- PPS_TC0WO1G3R : (PPS Offset: 0xB8) (R/W 32)  -------- */
#define PPS_TC0WO1G3R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO1G3R)   Reset Value */

#define PPS_TC0WO1G3R_TC0WO1_Pos              _UINT32_(0)                                          /* (PPS_TC0WO1G3R) TC0/WO1G3 Position */
#define PPS_TC0WO1G3R_TC0WO1_Msk              (_UINT32_(0xF) << PPS_TC0WO1G3R_TC0WO1_Pos)          /* (PPS_TC0WO1G3R) TC0/WO1G3 Mask */
#define PPS_TC0WO1G3R_TC0WO1(value)           (PPS_TC0WO1G3R_TC0WO1_Msk & (_UINT32_(value) << PPS_TC0WO1G3R_TC0WO1_Pos)) /* Assigment of value for TC0WO1 in the PPS_TC0WO1G3R register */
#define   PPS_TC0WO1G3R_TC0WO1_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO1G3R) RPA5  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_TC0WO1G3R) RPA9  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO1G3R) RPB6  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO1G3R) RPA4  */
#define   PPS_TC0WO1G3R_TC0WO1_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO1G3R) RPA8  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO1G3R) RPB5  */
#define   PPS_TC0WO1G3R_TC0WO1_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_TC0WO1G3R) RPB9  */
#define   PPS_TC0WO1G3R_TC0WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO1G3R) OFF  */
#define PPS_TC0WO1G3R_TC0WO1_RPA5             (PPS_TC0WO1G3R_TC0WO1_RPA5_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA5 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA9             (PPS_TC0WO1G3R_TC0WO1_RPA9_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA9 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB6             (PPS_TC0WO1G3R_TC0WO1_RPB6_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB6 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA4             (PPS_TC0WO1G3R_TC0WO1_RPA4_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA4 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPA8             (PPS_TC0WO1G3R_TC0WO1_RPA8_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPA8 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB5             (PPS_TC0WO1G3R_TC0WO1_RPB5_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB5 Position  */
#define PPS_TC0WO1G3R_TC0WO1_RPB9             (PPS_TC0WO1G3R_TC0WO1_RPB9_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) RPB9 Position  */
#define PPS_TC0WO1G3R_TC0WO1_OFF              (PPS_TC0WO1G3R_TC0WO1_OFF_Val << PPS_TC0WO1G3R_TC0WO1_Pos) /* (PPS_TC0WO1G3R) OFF Position  */
#define PPS_TC0WO1G3R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO1G3R) Register Mask  */


