Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
/* -------- PPS_TC0WO1G4R : (PPS Offset: 0xBC) (R/W 32)  -------- */
#define PPS_TC0WO1G4R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC0WO1G4R)   Reset Value */

#define PPS_TC0WO1G4R_TC0WO1_Pos              _UINT32_(0)                                          /* (PPS_TC0WO1G4R) TC0/WO1G4 Position */
#define PPS_TC0WO1G4R_TC0WO1_Msk              (_UINT32_(0xF) << PPS_TC0WO1G4R_TC0WO1_Pos)          /* (PPS_TC0WO1G4R) TC0/WO1G4 Mask */
#define PPS_TC0WO1G4R_TC0WO1(value)           (PPS_TC0WO1G4R_TC0WO1_Msk & (_UINT32_(value) << PPS_TC0WO1G4R_TC0WO1_Pos)) /* Assigment of value for TC0WO1 in the PPS_TC0WO1G4R register */
#define   PPS_TC0WO1G4R_TC0WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC0WO1G4R) RPA6  */
#define   PPS_TC0WO1G4R_TC0WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC0WO1G4R) RPA10  */
#define   PPS_TC0WO1G4R_TC0WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC0WO1G4R) RPB7  */
#define   PPS_TC0WO1G4R_TC0WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC0WO1G4R) RPA5  */
#define   PPS_TC0WO1G4R_TC0WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC0WO1G4R) RPA9  */
#define   PPS_TC0WO1G4R_TC0WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC0WO1G4R) RPB6  */
#define   PPS_TC0WO1G4R_TC0WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC0WO1G4R) RPA8  */
#define   PPS_TC0WO1G4R_TC0WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC0WO1G4R) OFF  */
#define PPS_TC0WO1G4R_TC0WO1_RPA6             (PPS_TC0WO1G4R_TC0WO1_RPA6_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPA6 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPA10            (PPS_TC0WO1G4R_TC0WO1_RPA10_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPA10 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPB7             (PPS_TC0WO1G4R_TC0WO1_RPB7_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPB7 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPA5             (PPS_TC0WO1G4R_TC0WO1_RPA5_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPA5 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPA9             (PPS_TC0WO1G4R_TC0WO1_RPA9_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPA9 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPB6             (PPS_TC0WO1G4R_TC0WO1_RPB6_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPB6 Position  */
#define PPS_TC0WO1G4R_TC0WO1_RPA8             (PPS_TC0WO1G4R_TC0WO1_RPA8_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) RPA8 Position  */
#define PPS_TC0WO1G4R_TC0WO1_OFF              (PPS_TC0WO1G4R_TC0WO1_OFF_Val << PPS_TC0WO1G4R_TC0WO1_Pos) /* (PPS_TC0WO1G4R) OFF Position  */
#define PPS_TC0WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC0WO1G4R) Register Mask  */


/* -------- PPS_TC1WO0G1R : (PPS Offset: 0xC0) (R/W 32)  -------- */
#define PPS_TC1WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC1WO0G1R)   Reset Value */

#define PPS_TC1WO0G1R_TC1WO0_Pos              _UINT32_(0)                                          /* (PPS_TC1WO0G1R) TC1/WO0G1 Position */
#define PPS_TC1WO0G1R_TC1WO0_Msk              (_UINT32_(0xF) << PPS_TC1WO0G1R_TC1WO0_Pos)          /* (PPS_TC1WO0G1R) TC1/WO0G1 Mask */
#define PPS_TC1WO0G1R_TC1WO0(value)           (PPS_TC1WO0G1R_TC1WO0_Msk & (_UINT32_(value) << PPS_TC1WO0G1R_TC1WO0_Pos)) /* Assigment of value for TC1WO0 in the PPS_TC1WO0G1R register */
#define   PPS_TC1WO0G1R_TC1WO0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_TC1WO0G1R) RPA9  */
#define   PPS_TC1WO0G1R_TC1WO0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_TC1WO0G1R) RPA3  */
#define   PPS_TC1WO0G1R_TC1WO0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_TC1WO0G1R) RPA7  */
#define   PPS_TC1WO0G1R_TC1WO0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_TC1WO0G1R) RPB4  */
#define   PPS_TC1WO0G1R_TC1WO0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_TC1WO0G1R) RPB8  */
#define   PPS_TC1WO0G1R_TC1WO0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_TC1WO0G1R) RPA6  */
#define   PPS_TC1WO0G1R_TC1WO0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_TC1WO0G1R) RPA10  */
#define   PPS_TC1WO0G1R_TC1WO0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_TC1WO0G1R) RPB7  */
#define   PPS_TC1WO0G1R_TC1WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC1WO0G1R) OFF  */
#define PPS_TC1WO0G1R_TC1WO0_RPA9             (PPS_TC1WO0G1R_TC1WO0_RPA9_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPA9 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPA3             (PPS_TC1WO0G1R_TC1WO0_RPA3_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPA3 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPA7             (PPS_TC1WO0G1R_TC1WO0_RPA7_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPA7 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPB4             (PPS_TC1WO0G1R_TC1WO0_RPB4_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPB4 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPB8             (PPS_TC1WO0G1R_TC1WO0_RPB8_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPB8 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPA6             (PPS_TC1WO0G1R_TC1WO0_RPA6_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPA6 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPA10            (PPS_TC1WO0G1R_TC1WO0_RPA10_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPA10 Position  */
#define PPS_TC1WO0G1R_TC1WO0_RPB7             (PPS_TC1WO0G1R_TC1WO0_RPB7_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) RPB7 Position  */
#define PPS_TC1WO0G1R_TC1WO0_OFF              (PPS_TC1WO0G1R_TC1WO0_OFF_Val << PPS_TC1WO0G1R_TC1WO0_Pos) /* (PPS_TC1WO0G1R) OFF Position  */
#define PPS_TC1WO0G1R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC1WO0G1R) Register Mask  */


