Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
/* -------- PPS_TC2WO1G4R : (PPS Offset: 0xD4) (R/W 32)  -------- */
#define PPS_TC2WO1G4R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC2WO1G4R)   Reset Value */

#define PPS_TC2WO1G4R_TC2WO1_Pos              _UINT32_(0)                                          /* (PPS_TC2WO1G4R) TC2/WO1G4 Position */
#define PPS_TC2WO1G4R_TC2WO1_Msk              (_UINT32_(0xF) << PPS_TC2WO1G4R_TC2WO1_Pos)          /* (PPS_TC2WO1G4R) TC2/WO1G4 Mask */
#define PPS_TC2WO1G4R_TC2WO1(value)           (PPS_TC2WO1G4R_TC2WO1_Msk & (_UINT32_(value) << PPS_TC2WO1G4R_TC2WO1_Pos)) /* Assigment of value for TC2WO1 in the PPS_TC2WO1G4R register */
#define   PPS_TC2WO1G4R_TC2WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC2WO1G4R) RPA6  */
#define   PPS_TC2WO1G4R_TC2WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC2WO1G4R) RPA10  */
#define   PPS_TC2WO1G4R_TC2WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC2WO1G4R) RPB7  */
#define   PPS_TC2WO1G4R_TC2WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC2WO1G4R) RPA5  */
#define   PPS_TC2WO1G4R_TC2WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC2WO1G4R) RPA9  */
#define   PPS_TC2WO1G4R_TC2WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC2WO1G4R) RPB6  */
#define   PPS_TC2WO1G4R_TC2WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC2WO1G4R) RPA8  */
#define   PPS_TC2WO1G4R_TC2WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC2WO1G4R) OFF  */
#define PPS_TC2WO1G4R_TC2WO1_RPA6             (PPS_TC2WO1G4R_TC2WO1_RPA6_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPA6 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPA10            (PPS_TC2WO1G4R_TC2WO1_RPA10_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPA10 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPB7             (PPS_TC2WO1G4R_TC2WO1_RPB7_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPB7 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPA5             (PPS_TC2WO1G4R_TC2WO1_RPA5_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPA5 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPA9             (PPS_TC2WO1G4R_TC2WO1_RPA9_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPA9 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPB6             (PPS_TC2WO1G4R_TC2WO1_RPB6_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPB6 Position  */
#define PPS_TC2WO1G4R_TC2WO1_RPA8             (PPS_TC2WO1G4R_TC2WO1_RPA8_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) RPA8 Position  */
#define PPS_TC2WO1G4R_TC2WO1_OFF              (PPS_TC2WO1G4R_TC2WO1_OFF_Val << PPS_TC2WO1G4R_TC2WO1_Pos) /* (PPS_TC2WO1G4R) OFF Position  */
#define PPS_TC2WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC2WO1G4R) Register Mask  */


/* -------- PPS_TC3WO0G1R : (PPS Offset: 0xD8) (R/W 32)  -------- */
#define PPS_TC3WO0G1R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC3WO0G1R)   Reset Value */

#define PPS_TC3WO0G1R_TC3WO0_Pos              _UINT32_(0)                                          /* (PPS_TC3WO0G1R) TC3/WO0G1 Position */
#define PPS_TC3WO0G1R_TC3WO0_Msk              (_UINT32_(0xF) << PPS_TC3WO0G1R_TC3WO0_Pos)          /* (PPS_TC3WO0G1R) TC3/WO0G1 Mask */
#define PPS_TC3WO0G1R_TC3WO0(value)           (PPS_TC3WO0G1R_TC3WO0_Msk & (_UINT32_(value) << PPS_TC3WO0G1R_TC3WO0_Pos)) /* Assigment of value for TC3WO0 in the PPS_TC3WO0G1R register */
#define   PPS_TC3WO0G1R_TC3WO0_RPA9_Val       _UINT32_(0xF)                                        /* (PPS_TC3WO0G1R) RPA9  */
#define   PPS_TC3WO0G1R_TC3WO0_RPA3_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO0G1R) RPA3  */
#define   PPS_TC3WO0G1R_TC3WO0_RPA7_Val       _UINT32_(0x2)                                        /* (PPS_TC3WO0G1R) RPA7  */
#define   PPS_TC3WO0G1R_TC3WO0_RPB4_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO0G1R) RPB4  */
#define   PPS_TC3WO0G1R_TC3WO0_RPB8_Val       _UINT32_(0x6)                                        /* (PPS_TC3WO0G1R) RPB8  */
#define   PPS_TC3WO0G1R_TC3WO0_RPA6_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO0G1R) RPA6  */
#define   PPS_TC3WO0G1R_TC3WO0_RPA10_Val      _UINT32_(0xA)                                        /* (PPS_TC3WO0G1R) RPA10  */
#define   PPS_TC3WO0G1R_TC3WO0_RPB7_Val       _UINT32_(0xD)                                        /* (PPS_TC3WO0G1R) RPB7  */
#define   PPS_TC3WO0G1R_TC3WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO0G1R) OFF  */
#define PPS_TC3WO0G1R_TC3WO0_RPA9             (PPS_TC3WO0G1R_TC3WO0_RPA9_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPA9 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPA3             (PPS_TC3WO0G1R_TC3WO0_RPA3_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPA3 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPA7             (PPS_TC3WO0G1R_TC3WO0_RPA7_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPA7 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPB4             (PPS_TC3WO0G1R_TC3WO0_RPB4_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPB4 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPB8             (PPS_TC3WO0G1R_TC3WO0_RPB8_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPB8 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPA6             (PPS_TC3WO0G1R_TC3WO0_RPA6_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPA6 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPA10            (PPS_TC3WO0G1R_TC3WO0_RPA10_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPA10 Position  */
#define PPS_TC3WO0G1R_TC3WO0_RPB7             (PPS_TC3WO0G1R_TC3WO0_RPB7_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) RPB7 Position  */
#define PPS_TC3WO0G1R_TC3WO0_OFF              (PPS_TC3WO0G1R_TC3WO0_OFF_Val << PPS_TC3WO0G1R_TC3WO0_Pos) /* (PPS_TC3WO0G1R) OFF Position  */
#define PPS_TC3WO0G1R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO0G1R) Register Mask  */


/* -------- PPS_TC3WO0G3R : (PPS Offset: 0xDC) (R/W 32)  -------- */
#define PPS_TC3WO0G3R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC3WO0G3R)   Reset Value */

#define PPS_TC3WO0G3R_TC3WO0_Pos              _UINT32_(0)                                          /* (PPS_TC3WO0G3R) TC3/WO0G3 Position */
#define PPS_TC3WO0G3R_TC3WO0_Msk              (_UINT32_(0xF) << PPS_TC3WO0G3R_TC3WO0_Pos)          /* (PPS_TC3WO0G3R) TC3/WO0G3 Mask */
#define PPS_TC3WO0G3R_TC3WO0(value)           (PPS_TC3WO0G3R_TC3WO0_Msk & (_UINT32_(value) << PPS_TC3WO0G3R_TC3WO0_Pos)) /* Assigment of value for TC3WO0 in the PPS_TC3WO0G3R register */
#define   PPS_TC3WO0G3R_TC3WO0_RPA5_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO0G3R) RPA5  */
#define   PPS_TC3WO0G3R_TC3WO0_RPA9_Val       _UINT32_(0x2)                                        /* (PPS_TC3WO0G3R) RPA9  */
#define   PPS_TC3WO0G3R_TC3WO0_RPB6_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO0G3R) RPB6  */
#define   PPS_TC3WO0G3R_TC3WO0_RPA4_Val       _UINT32_(0x8)                                        /* (PPS_TC3WO0G3R) RPA4  */
#define   PPS_TC3WO0G3R_TC3WO0_RPA8_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO0G3R) RPA8  */
#define   PPS_TC3WO0G3R_TC3WO0_RPB5_Val       _UINT32_(0xC)                                        /* (PPS_TC3WO0G3R) RPB5  */
#define   PPS_TC3WO0G3R_TC3WO0_RPB9_Val       _UINT32_(0xD)                                        /* (PPS_TC3WO0G3R) RPB9  */
#define   PPS_TC3WO0G3R_TC3WO0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO0G3R) OFF  */
#define PPS_TC3WO0G3R_TC3WO0_RPA5             (PPS_TC3WO0G3R_TC3WO0_RPA5_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPA5 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPA9             (PPS_TC3WO0G3R_TC3WO0_RPA9_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPA9 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPB6             (PPS_TC3WO0G3R_TC3WO0_RPB6_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPB6 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPA4             (PPS_TC3WO0G3R_TC3WO0_RPA4_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPA4 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPA8             (PPS_TC3WO0G3R_TC3WO0_RPA8_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPA8 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPB5             (PPS_TC3WO0G3R_TC3WO0_RPB5_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPB5 Position  */
#define PPS_TC3WO0G3R_TC3WO0_RPB9             (PPS_TC3WO0G3R_TC3WO0_RPB9_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) RPB9 Position  */
#define PPS_TC3WO0G3R_TC3WO0_OFF              (PPS_TC3WO0G3R_TC3WO0_OFF_Val << PPS_TC3WO0G3R_TC3WO0_Pos) /* (PPS_TC3WO0G3R) OFF Position  */
#define PPS_TC3WO0G3R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO0G3R) Register Mask  */


/* -------- PPS_TC3WO1G2R : (PPS Offset: 0xE0) (R/W 32)  -------- */
#define PPS_TC3WO1G2R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC3WO1G2R)   Reset Value */

#define PPS_TC3WO1G2R_TC3WO1_Pos              _UINT32_(0)                                          /* (PPS_TC3WO1G2R) TC3/WO1G2 Position */
#define PPS_TC3WO1G2R_TC3WO1_Msk              (_UINT32_(0xF) << PPS_TC3WO1G2R_TC3WO1_Pos)          /* (PPS_TC3WO1G2R) TC3/WO1G2 Mask */
#define PPS_TC3WO1G2R_TC3WO1(value)           (PPS_TC3WO1G2R_TC3WO1_Msk & (_UINT32_(value) << PPS_TC3WO1G2R_TC3WO1_Pos)) /* Assigment of value for TC3WO1 in the PPS_TC3WO1G2R register */
#define   PPS_TC3WO1G2R_TC3WO1_RPA4_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO1G2R) RPA4  */
#define   PPS_TC3WO1G2R_TC3WO1_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_TC3WO1G2R) RPA8  */
#define   PPS_TC3WO1G2R_TC3WO1_RPB5_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO1G2R) RPB5  */
#define   PPS_TC3WO1G2R_TC3WO1_RPB9_Val       _UINT32_(0x6)                                        /* (PPS_TC3WO1G2R) RPB9  */
#define   PPS_TC3WO1G2R_TC3WO1_RPA3_Val       _UINT32_(0x8)                                        /* (PPS_TC3WO1G2R) RPA3  */
#define   PPS_TC3WO1G2R_TC3WO1_RPA7_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO1G2R) RPA7  */
#define   PPS_TC3WO1G2R_TC3WO1_RPB4_Val       _UINT32_(0xC)                                        /* (PPS_TC3WO1G2R) RPB4  */
#define   PPS_TC3WO1G2R_TC3WO1_RPB8_Val       _UINT32_(0xD)                                        /* (PPS_TC3WO1G2R) RPB8  */
#define   PPS_TC3WO1G2R_TC3WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO1G2R) OFF  */
#define PPS_TC3WO1G2R_TC3WO1_RPA4             (PPS_TC3WO1G2R_TC3WO1_RPA4_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPA4 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPA8             (PPS_TC3WO1G2R_TC3WO1_RPA8_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPA8 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPB5             (PPS_TC3WO1G2R_TC3WO1_RPB5_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPB5 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPB9             (PPS_TC3WO1G2R_TC3WO1_RPB9_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPB9 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPA3             (PPS_TC3WO1G2R_TC3WO1_RPA3_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPA3 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPA7             (PPS_TC3WO1G2R_TC3WO1_RPA7_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPA7 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPB4             (PPS_TC3WO1G2R_TC3WO1_RPB4_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPB4 Position  */
#define PPS_TC3WO1G2R_TC3WO1_RPB8             (PPS_TC3WO1G2R_TC3WO1_RPB8_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) RPB8 Position  */
#define PPS_TC3WO1G2R_TC3WO1_OFF              (PPS_TC3WO1G2R_TC3WO1_OFF_Val << PPS_TC3WO1G2R_TC3WO1_Pos) /* (PPS_TC3WO1G2R) OFF Position  */
#define PPS_TC3WO1G2R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO1G2R) Register Mask  */


/* -------- PPS_TC3WO1G4R : (PPS Offset: 0xE4) (R/W 32)  -------- */
#define PPS_TC3WO1G4R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC3WO1G4R)   Reset Value */

#define PPS_TC3WO1G4R_TC3WO1_Pos              _UINT32_(0)                                          /* (PPS_TC3WO1G4R) TC3/WO1G4 Position */
#define PPS_TC3WO1G4R_TC3WO1_Msk              (_UINT32_(0xF) << PPS_TC3WO1G4R_TC3WO1_Pos)          /* (PPS_TC3WO1G4R) TC3/WO1G4 Mask */
#define PPS_TC3WO1G4R_TC3WO1(value)           (PPS_TC3WO1G4R_TC3WO1_Msk & (_UINT32_(value) << PPS_TC3WO1G4R_TC3WO1_Pos)) /* Assigment of value for TC3WO1 in the PPS_TC3WO1G4R register */
#define   PPS_TC3WO1G4R_TC3WO1_RPA6_Val       _UINT32_(0x1)                                        /* (PPS_TC3WO1G4R) RPA6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA10_Val      _UINT32_(0x2)                                        /* (PPS_TC3WO1G4R) RPA10  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB7_Val       _UINT32_(0x5)                                        /* (PPS_TC3WO1G4R) RPB7  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA5_Val       _UINT32_(0x8)                                        /* (PPS_TC3WO1G4R) RPA5  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA9_Val       _UINT32_(0x9)                                        /* (PPS_TC3WO1G4R) RPA9  */
#define   PPS_TC3WO1G4R_TC3WO1_RPB6_Val       _UINT32_(0xC)                                        /* (PPS_TC3WO1G4R) RPB6  */
#define   PPS_TC3WO1G4R_TC3WO1_RPA8_Val       _UINT32_(0xE)                                        /* (PPS_TC3WO1G4R) RPA8  */
#define   PPS_TC3WO1G4R_TC3WO1_OFF_Val        _UINT32_(0x0)                                        /* (PPS_TC3WO1G4R) OFF  */
#define PPS_TC3WO1G4R_TC3WO1_RPA6             (PPS_TC3WO1G4R_TC3WO1_RPA6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA10            (PPS_TC3WO1G4R_TC3WO1_RPA10_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA10 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB7             (PPS_TC3WO1G4R_TC3WO1_RPB7_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB7 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA5             (PPS_TC3WO1G4R_TC3WO1_RPA5_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA5 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA9             (PPS_TC3WO1G4R_TC3WO1_RPA9_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA9 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPB6             (PPS_TC3WO1G4R_TC3WO1_RPB6_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPB6 Position  */
#define PPS_TC3WO1G4R_TC3WO1_RPA8             (PPS_TC3WO1G4R_TC3WO1_RPA8_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) RPA8 Position  */
#define PPS_TC3WO1G4R_TC3WO1_OFF              (PPS_TC3WO1G4R_TC3WO1_OFF_Val << PPS_TC3WO1G4R_TC3WO1_Pos) /* (PPS_TC3WO1G4R) OFF Position  */
#define PPS_TC3WO1G4R_Msk                     _UINT32_(0x0000000F)                                 /* (PPS_TC3WO1G4R) Register Mask  */


