Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#define PPS_RPA4G3R_RPA4G3R_Pos               _UINT32_(0)                                          /* (PPS_RPA4G3R) RPA4/G3 Position */
#define PPS_RPA4G3R_RPA4G3R_Msk               (_UINT32_(0x1F) << PPS_RPA4G3R_RPA4G3R_Pos)          /* (PPS_RPA4G3R) RPA4/G3 Mask */
#define PPS_RPA4G3R_RPA4G3R(value)            (PPS_RPA4G3R_RPA4G3R_Msk & (_UINT32_(value) << PPS_RPA4G3R_RPA4G3R_Pos)) /* Assigment of value for RPA4G3R in the PPS_RPA4G3R register */
#define   PPS_RPA4G3R_RPA4G3R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA4G3R) OFF  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM0P1_Val     _UINT32_(0x1)                                        /* (PPS_RPA4G3R) SERCOM0/PAD1  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM0P0_Val     _UINT32_(0x2)                                        /* (PPS_RPA4G3R) SERCOM0/PAD0  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM0P3_Val     _UINT32_(0x3)                                        /* (PPS_RPA4G3R) SERCOM0/PAD3  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM1P2_Val     _UINT32_(0x4)                                        /* (PPS_RPA4G3R) SERCOM1/PAD2  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM1P0_Val     _UINT32_(0x5)                                        /* (PPS_RPA4G3R) SERCOM1/PAD0  */
#define   PPS_RPA4G3R_RPA4G3R_SCOM1P3_Val     _UINT32_(0x6)                                        /* (PPS_RPA4G3R) SERCOM1/PAD3  */
#define   PPS_RPA4G3R_RPA4G3R_TCC0WO2_Val     _UINT32_(0xB)                                        /* (PPS_RPA4G3R) TCC0/WO2  */
#define   PPS_RPA4G3R_RPA4G3R_TCC0WO0_Val     _UINT32_(0xC)                                        /* (PPS_RPA4G3R) TCC0/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_TCC0WO4_Val     _UINT32_(0xD)                                        /* (PPS_RPA4G3R) TCC0/WO4  */
#define   PPS_RPA4G3R_RPA4G3R_TCC1WO2_Val     _UINT32_(0xE)                                        /* (PPS_RPA4G3R) TCC1/WO2  */
#define   PPS_RPA4G3R_RPA4G3R_TCC1WO0_Val     _UINT32_(0xF)                                        /* (PPS_RPA4G3R) TCC1/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_TCC1WO4_Val     _UINT32_(0x10)                                       /* (PPS_RPA4G3R) TCC1/WO4  */
#define   PPS_RPA4G3R_RPA4G3R_TCC2WO0_Val     _UINT32_(0x11)                                       /* (PPS_RPA4G3R) TCC2/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_TC0WO0_Val      _UINT32_(0x12)                                       /* (PPS_RPA4G3R) TC0/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_REFO3_Val       _UINT32_(0x13)                                       /* (PPS_RPA4G3R) REFO3  */
#define   PPS_RPA4G3R_RPA4G3R_TC1WO0_Val      _UINT32_(0x14)                                       /* (PPS_RPA4G3R) TC1/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_TC2WO0_Val      _UINT32_(0x15)                                       /* (PPS_RPA4G3R) TC2/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_TC3WO0_Val      _UINT32_(0x16)                                       /* (PPS_RPA4G3R) TC3/WO0  */
#define   PPS_RPA4G3R_RPA4G3R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPA4G3R) QSCK  */
#define   PPS_RPA4G3R_RPA4G3R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPA4G3R) QCS  */
#define   PPS_RPA4G3R_RPA4G3R_QD1_Val         _UINT32_(0x19)                                       /* (PPS_RPA4G3R) QD1  */
#define   PPS_RPA4G3R_RPA4G3R_QD0_Val         _UINT32_(0x1A)                                       /* (PPS_RPA4G3R) QD0  */
#define   PPS_RPA4G3R_RPA4G3R_QD3_Val         _UINT32_(0x1B)                                       /* (PPS_RPA4G3R) QD3  */
#define   PPS_RPA4G3R_RPA4G3R_CCLOUT0_Val     _UINT32_(0x1C)                                       /* (PPS_RPA4G3R) CCLOUT0  */
#define   PPS_RPA4G3R_RPA4G3R_TSTBUS2_Val     _UINT32_(0x1D)                                       /* (PPS_RPA4G3R) TSTBUS2  */
#define   PPS_RPA4G3R_RPA4G3R_TSTBUS6_Val     _UINT32_(0x1E)                                       /* (PPS_RPA4G3R) TSTBUS6  */
#define   PPS_RPA4G3R_RPA4G3R_TSTBUS10_Val    _UINT32_(0x1F)                                       /* (PPS_RPA4G3R) TSTBUS10  */
#define PPS_RPA4G3R_RPA4G3R_OFF               (PPS_RPA4G3R_RPA4G3R_OFF_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) OFF Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM0P1           (PPS_RPA4G3R_RPA4G3R_SCOM0P1_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM0/PAD1 Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM0P0           (PPS_RPA4G3R_RPA4G3R_SCOM0P0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM0/PAD0 Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM0P3           (PPS_RPA4G3R_RPA4G3R_SCOM0P3_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM0/PAD3 Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM1P2           (PPS_RPA4G3R_RPA4G3R_SCOM1P2_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM1/PAD2 Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM1P0           (PPS_RPA4G3R_RPA4G3R_SCOM1P0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM1/PAD0 Position  */
#define PPS_RPA4G3R_RPA4G3R_SCOM1P3           (PPS_RPA4G3R_RPA4G3R_SCOM1P3_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) SERCOM1/PAD3 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC0WO2           (PPS_RPA4G3R_RPA4G3R_TCC0WO2_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC0/WO2 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC0WO0           (PPS_RPA4G3R_RPA4G3R_TCC0WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC0/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC0WO4           (PPS_RPA4G3R_RPA4G3R_TCC0WO4_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC0/WO4 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC1WO2           (PPS_RPA4G3R_RPA4G3R_TCC1WO2_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC1/WO2 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC1WO0           (PPS_RPA4G3R_RPA4G3R_TCC1WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC1/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC1WO4           (PPS_RPA4G3R_RPA4G3R_TCC1WO4_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC1/WO4 Position  */
#define PPS_RPA4G3R_RPA4G3R_TCC2WO0           (PPS_RPA4G3R_RPA4G3R_TCC2WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TCC2/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TC0WO0            (PPS_RPA4G3R_RPA4G3R_TC0WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TC0/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_REFO3             (PPS_RPA4G3R_RPA4G3R_REFO3_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) REFO3 Position  */
#define PPS_RPA4G3R_RPA4G3R_TC1WO0            (PPS_RPA4G3R_RPA4G3R_TC1WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TC1/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TC2WO0            (PPS_RPA4G3R_RPA4G3R_TC2WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TC2/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TC3WO0            (PPS_RPA4G3R_RPA4G3R_TC3WO0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TC3/WO0 Position  */
#define PPS_RPA4G3R_RPA4G3R_QSCK              (PPS_RPA4G3R_RPA4G3R_QSCK_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) QSCK Position  */
#define PPS_RPA4G3R_RPA4G3R_QCS               (PPS_RPA4G3R_RPA4G3R_QCS_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) QCS Position  */
#define PPS_RPA4G3R_RPA4G3R_QD1               (PPS_RPA4G3R_RPA4G3R_QD1_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) QD1 Position  */
#define PPS_RPA4G3R_RPA4G3R_QD0               (PPS_RPA4G3R_RPA4G3R_QD0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) QD0 Position  */
#define PPS_RPA4G3R_RPA4G3R_QD3               (PPS_RPA4G3R_RPA4G3R_QD3_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) QD3 Position  */
#define PPS_RPA4G3R_RPA4G3R_CCLOUT0           (PPS_RPA4G3R_RPA4G3R_CCLOUT0_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) CCLOUT0 Position  */
#define PPS_RPA4G3R_RPA4G3R_TSTBUS2           (PPS_RPA4G3R_RPA4G3R_TSTBUS2_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TSTBUS2 Position  */
#define PPS_RPA4G3R_RPA4G3R_TSTBUS6           (PPS_RPA4G3R_RPA4G3R_TSTBUS6_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TSTBUS6 Position  */
#define PPS_RPA4G3R_RPA4G3R_TSTBUS10          (PPS_RPA4G3R_RPA4G3R_TSTBUS10_Val << PPS_RPA4G3R_RPA4G3R_Pos) /* (PPS_RPA4G3R) TSTBUS10 Position  */
#define PPS_RPA4G3R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA4G3R) Register Mask  */


/* -------- PPS_RPA4G4R : (PPS Offset: 0x22C) (R/W 32)  -------- */
#define PPS_RPA4G4R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA4G4R)   Reset Value */

#define PPS_RPA4G4R_RPA4G4R_Pos               _UINT32_(0)                                          /* (PPS_RPA4G4R) RPA4/G4 Position */
#define PPS_RPA4G4R_RPA4G4R_Msk               (_UINT32_(0x1F) << PPS_RPA4G4R_RPA4G4R_Pos)          /* (PPS_RPA4G4R) RPA4/G4 Mask */
#define PPS_RPA4G4R_RPA4G4R(value)            (PPS_RPA4G4R_RPA4G4R_Msk & (_UINT32_(value) << PPS_RPA4G4R_RPA4G4R_Pos)) /* Assigment of value for RPA4G4R in the PPS_RPA4G4R register */
#define   PPS_RPA4G4R_RPA4G4R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPA4G4R) OFF  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM0P2_Val     _UINT32_(0x1)                                        /* (PPS_RPA4G4R) SERCOM0/PAD2  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM0P1_Val     _UINT32_(0x2)                                        /* (PPS_RPA4G4R) SERCOM0/PAD1  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM0P0_Val     _UINT32_(0x3)                                        /* (PPS_RPA4G4R) SERCOM0/PAD0  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM1P3_Val     _UINT32_(0x4)                                        /* (PPS_RPA4G4R) SERCOM1/PAD3  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM1P1_Val     _UINT32_(0x5)                                        /* (PPS_RPA4G4R) SERCOM1/PAD1  */
#define   PPS_RPA4G4R_RPA4G4R_SCOM1P0_Val     _UINT32_(0x6)                                        /* (PPS_RPA4G4R) SERCOM1/PAD0  */
#define   PPS_RPA4G4R_RPA4G4R_TCC0WO3_Val     _UINT32_(0xB)                                        /* (PPS_RPA4G4R) TCC0/WO3  */
#define   PPS_RPA4G4R_RPA4G4R_TCC0WO1_Val     _UINT32_(0xC)                                        /* (PPS_RPA4G4R) TCC0/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_TCC0WO5_Val     _UINT32_(0xD)                                        /* (PPS_RPA4G4R) TCC0/WO5  */
#define   PPS_RPA4G4R_RPA4G4R_TCC1WO3_Val     _UINT32_(0xE)                                        /* (PPS_RPA4G4R) TCC1/WO3  */
#define   PPS_RPA4G4R_RPA4G4R_TCC1WO1_Val     _UINT32_(0xF)                                        /* (PPS_RPA4G4R) TCC1/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_TCC1WO5_Val     _UINT32_(0x10)                                       /* (PPS_RPA4G4R) TCC1/WO5  */
#define   PPS_RPA4G4R_RPA4G4R_TCC2WO1_Val     _UINT32_(0x11)                                       /* (PPS_RPA4G4R) TCC2/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_TC0WO0_Val      _UINT32_(0x12)                                       /* (PPS_RPA4G4R) TC0/WO0  */
#define   PPS_RPA4G4R_RPA4G4R_REFO4_Val       _UINT32_(0x13)                                       /* (PPS_RPA4G4R) REFO4  */
#define   PPS_RPA4G4R_RPA4G4R_TC1WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPA4G4R) TC1/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_TC2WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPA4G4R) TC2/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_TC3WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPA4G4R) TC3/WO1  */
#define   PPS_RPA4G4R_RPA4G4R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPA4G4R) QSCK  */
#define   PPS_RPA4G4R_RPA4G4R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPA4G4R) QCS  */
#define   PPS_RPA4G4R_RPA4G4R_QD2_Val         _UINT32_(0x19)                                       /* (PPS_RPA4G4R) QD2  */
#define   PPS_RPA4G4R_RPA4G4R_QD1_Val         _UINT32_(0x1A)                                       /* (PPS_RPA4G4R) QD1  */
#define   PPS_RPA4G4R_RPA4G4R_QD0_Val         _UINT32_(0x1B)                                       /* (PPS_RPA4G4R) QD0  */
#define   PPS_RPA4G4R_RPA4G4R_CCLOUT1_Val     _UINT32_(0x1C)                                       /* (PPS_RPA4G4R) CCLOUT1  */
#define   PPS_RPA4G4R_RPA4G4R_TSTBUS3_Val     _UINT32_(0x1D)                                       /* (PPS_RPA4G4R) TSTBUS3  */
#define   PPS_RPA4G4R_RPA4G4R_TSTBUS7_Val     _UINT32_(0x1E)                                       /* (PPS_RPA4G4R) TSTBUS7  */
#define   PPS_RPA4G4R_RPA4G4R_TSTBUS11_Val    _UINT32_(0x1F)                                       /* (PPS_RPA4G4R) TSTBUS11  */
#define PPS_RPA4G4R_RPA4G4R_OFF               (PPS_RPA4G4R_RPA4G4R_OFF_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) OFF Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM0P2           (PPS_RPA4G4R_RPA4G4R_SCOM0P2_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM0/PAD2 Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM0P1           (PPS_RPA4G4R_RPA4G4R_SCOM0P1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM0/PAD1 Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM0P0           (PPS_RPA4G4R_RPA4G4R_SCOM0P0_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM0/PAD0 Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM1P3           (PPS_RPA4G4R_RPA4G4R_SCOM1P3_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM1/PAD3 Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM1P1           (PPS_RPA4G4R_RPA4G4R_SCOM1P1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM1/PAD1 Position  */
#define PPS_RPA4G4R_RPA4G4R_SCOM1P0           (PPS_RPA4G4R_RPA4G4R_SCOM1P0_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) SERCOM1/PAD0 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC0WO3           (PPS_RPA4G4R_RPA4G4R_TCC0WO3_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC0/WO3 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC0WO1           (PPS_RPA4G4R_RPA4G4R_TCC0WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC0/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC0WO5           (PPS_RPA4G4R_RPA4G4R_TCC0WO5_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC0/WO5 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC1WO3           (PPS_RPA4G4R_RPA4G4R_TCC1WO3_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC1/WO3 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC1WO1           (PPS_RPA4G4R_RPA4G4R_TCC1WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC1/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC1WO5           (PPS_RPA4G4R_RPA4G4R_TCC1WO5_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC1/WO5 Position  */
#define PPS_RPA4G4R_RPA4G4R_TCC2WO1           (PPS_RPA4G4R_RPA4G4R_TCC2WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TCC2/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TC0WO0            (PPS_RPA4G4R_RPA4G4R_TC0WO0_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TC0/WO0 Position  */
#define PPS_RPA4G4R_RPA4G4R_REFO4             (PPS_RPA4G4R_RPA4G4R_REFO4_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) REFO4 Position  */
#define PPS_RPA4G4R_RPA4G4R_TC1WO1            (PPS_RPA4G4R_RPA4G4R_TC1WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TC1/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TC2WO1            (PPS_RPA4G4R_RPA4G4R_TC2WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TC2/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TC3WO1            (PPS_RPA4G4R_RPA4G4R_TC3WO1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TC3/WO1 Position  */
#define PPS_RPA4G4R_RPA4G4R_QSCK              (PPS_RPA4G4R_RPA4G4R_QSCK_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) QSCK Position  */
#define PPS_RPA4G4R_RPA4G4R_QCS               (PPS_RPA4G4R_RPA4G4R_QCS_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) QCS Position  */
#define PPS_RPA4G4R_RPA4G4R_QD2               (PPS_RPA4G4R_RPA4G4R_QD2_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) QD2 Position  */
#define PPS_RPA4G4R_RPA4G4R_QD1               (PPS_RPA4G4R_RPA4G4R_QD1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) QD1 Position  */
#define PPS_RPA4G4R_RPA4G4R_QD0               (PPS_RPA4G4R_RPA4G4R_QD0_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) QD0 Position  */
#define PPS_RPA4G4R_RPA4G4R_CCLOUT1           (PPS_RPA4G4R_RPA4G4R_CCLOUT1_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) CCLOUT1 Position  */
#define PPS_RPA4G4R_RPA4G4R_TSTBUS3           (PPS_RPA4G4R_RPA4G4R_TSTBUS3_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TSTBUS3 Position  */
#define PPS_RPA4G4R_RPA4G4R_TSTBUS7           (PPS_RPA4G4R_RPA4G4R_TSTBUS7_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TSTBUS7 Position  */
#define PPS_RPA4G4R_RPA4G4R_TSTBUS11          (PPS_RPA4G4R_RPA4G4R_TSTBUS11_Val << PPS_RPA4G4R_RPA4G4R_Pos) /* (PPS_RPA4G4R) TSTBUS11 Position  */
#define PPS_RPA4G4R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPA4G4R) Register Mask  */


/* -------- PPS_RPA5G1R : (PPS Offset: 0x230) (R/W 32)  -------- */
#define PPS_RPA5G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPA5G1R)   Reset Value */

