Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
/* -------- PPS_RPA10G1R : (PPS Offset: 0x268) (R/W 32)  -------- */
#define PPS_RPA10G1R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPA10G1R)   Reset Value */

#define PPS_RPA10G1R_RPA10G1R_Pos             _UINT32_(0)                                          /* (PPS_RPA10G1R) RPA10/G1 Position */
#define PPS_RPA10G1R_RPA10G1R_Msk             (_UINT32_(0x1F) << PPS_RPA10G1R_RPA10G1R_Pos)        /* (PPS_RPA10G1R) RPA10/G1 Mask */
#define PPS_RPA10G1R_RPA10G1R(value)          (PPS_RPA10G1R_RPA10G1R_Msk & (_UINT32_(value) << PPS_RPA10G1R_RPA10G1R_Pos)) /* Assigment of value for RPA10G1R in the PPS_RPA10G1R register */
#define   PPS_RPA10G1R_RPA10G1R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPA10G1R) OFF  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM0P3_Val   _UINT32_(0x1)                                        /* (PPS_RPA10G1R) SERCOM0/PAD3  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM0P2_Val   _UINT32_(0x2)                                        /* (PPS_RPA10G1R) SERCOM0/PAD2  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM0P1_Val   _UINT32_(0x3)                                        /* (PPS_RPA10G1R) SERCOM0/PAD1  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM1P0_Val   _UINT32_(0x4)                                        /* (PPS_RPA10G1R) SERCOM1/PAD0  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM1P2_Val   _UINT32_(0x5)                                        /* (PPS_RPA10G1R) SERCOM1/PAD2  */
#define   PPS_RPA10G1R_RPA10G1R_SCOM1P1_Val   _UINT32_(0x6)                                        /* (PPS_RPA10G1R) SERCOM1/PAD1  */
#define   PPS_RPA10G1R_RPA10G1R_TCC0WO0_Val   _UINT32_(0xB)                                        /* (PPS_RPA10G1R) TCC0/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_TCC0WO4_Val   _UINT32_(0xC)                                        /* (PPS_RPA10G1R) TCC0/WO4  */
#define   PPS_RPA10G1R_RPA10G1R_TCC0WO2_Val   _UINT32_(0xD)                                        /* (PPS_RPA10G1R) TCC0/WO2  */
#define   PPS_RPA10G1R_RPA10G1R_TCC1WO0_Val   _UINT32_(0xE)                                        /* (PPS_RPA10G1R) TCC1/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_TCC1WO4_Val   _UINT32_(0xF)                                        /* (PPS_RPA10G1R) TCC1/WO4  */
#define   PPS_RPA10G1R_RPA10G1R_TCC1WO2_Val   _UINT32_(0x10)                                       /* (PPS_RPA10G1R) TCC1/WO2  */
#define   PPS_RPA10G1R_RPA10G1R_TCC2WO0_Val   _UINT32_(0x11)                                       /* (PPS_RPA10G1R) TCC2/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_TC0WO1_Val    _UINT32_(0x12)                                       /* (PPS_RPA10G1R) TC0/WO1  */
#define   PPS_RPA10G1R_RPA10G1R_REFO1_Val     _UINT32_(0x13)                                       /* (PPS_RPA10G1R) REFO1  */
#define   PPS_RPA10G1R_RPA10G1R_TC1WO0_Val    _UINT32_(0x14)                                       /* (PPS_RPA10G1R) TC1/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_TC2WO0_Val    _UINT32_(0x15)                                       /* (PPS_RPA10G1R) TC2/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_TC3WO0_Val    _UINT32_(0x16)                                       /* (PPS_RPA10G1R) TC3/WO0  */
#define   PPS_RPA10G1R_RPA10G1R_QSCK_Val      _UINT32_(0x17)                                       /* (PPS_RPA10G1R) QSCK  */
#define   PPS_RPA10G1R_RPA10G1R_QCS_Val       _UINT32_(0x18)                                       /* (PPS_RPA10G1R) QCS  */
#define   PPS_RPA10G1R_RPA10G1R_QD3_Val       _UINT32_(0x19)                                       /* (PPS_RPA10G1R) QD3  */
#define   PPS_RPA10G1R_RPA10G1R_QD2_Val       _UINT32_(0x1A)                                       /* (PPS_RPA10G1R) QD2  */
#define   PPS_RPA10G1R_RPA10G1R_QD1_Val       _UINT32_(0x1B)                                       /* (PPS_RPA10G1R) QD1  */
#define   PPS_RPA10G1R_RPA10G1R_CCLOUT0_Val   _UINT32_(0x1C)                                       /* (PPS_RPA10G1R) CCLOUT0  */
#define   PPS_RPA10G1R_RPA10G1R_TSTBUS0_Val   _UINT32_(0x1D)                                       /* (PPS_RPA10G1R) TSTBUS0  */
#define   PPS_RPA10G1R_RPA10G1R_TSTBUS4_Val   _UINT32_(0x1E)                                       /* (PPS_RPA10G1R) TSTBUS4  */
#define   PPS_RPA10G1R_RPA10G1R_TSTBUS8_Val   _UINT32_(0x1F)                                       /* (PPS_RPA10G1R) TSTBUS8  */
#define PPS_RPA10G1R_RPA10G1R_OFF             (PPS_RPA10G1R_RPA10G1R_OFF_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) OFF Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM0P3         (PPS_RPA10G1R_RPA10G1R_SCOM0P3_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM0/PAD3 Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM0P2         (PPS_RPA10G1R_RPA10G1R_SCOM0P2_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM0/PAD2 Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM0P1         (PPS_RPA10G1R_RPA10G1R_SCOM0P1_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM0/PAD1 Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM1P0         (PPS_RPA10G1R_RPA10G1R_SCOM1P0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM1/PAD0 Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM1P2         (PPS_RPA10G1R_RPA10G1R_SCOM1P2_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM1/PAD2 Position  */
#define PPS_RPA10G1R_RPA10G1R_SCOM1P1         (PPS_RPA10G1R_RPA10G1R_SCOM1P1_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) SERCOM1/PAD1 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC0WO0         (PPS_RPA10G1R_RPA10G1R_TCC0WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC0/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC0WO4         (PPS_RPA10G1R_RPA10G1R_TCC0WO4_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC0/WO4 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC0WO2         (PPS_RPA10G1R_RPA10G1R_TCC0WO2_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC0/WO2 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC1WO0         (PPS_RPA10G1R_RPA10G1R_TCC1WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC1/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC1WO4         (PPS_RPA10G1R_RPA10G1R_TCC1WO4_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC1/WO4 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC1WO2         (PPS_RPA10G1R_RPA10G1R_TCC1WO2_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC1/WO2 Position  */
#define PPS_RPA10G1R_RPA10G1R_TCC2WO0         (PPS_RPA10G1R_RPA10G1R_TCC2WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TCC2/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TC0WO1          (PPS_RPA10G1R_RPA10G1R_TC0WO1_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TC0/WO1 Position  */
#define PPS_RPA10G1R_RPA10G1R_REFO1           (PPS_RPA10G1R_RPA10G1R_REFO1_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) REFO1 Position  */
#define PPS_RPA10G1R_RPA10G1R_TC1WO0          (PPS_RPA10G1R_RPA10G1R_TC1WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TC1/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TC2WO0          (PPS_RPA10G1R_RPA10G1R_TC2WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TC2/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TC3WO0          (PPS_RPA10G1R_RPA10G1R_TC3WO0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TC3/WO0 Position  */
#define PPS_RPA10G1R_RPA10G1R_QSCK            (PPS_RPA10G1R_RPA10G1R_QSCK_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) QSCK Position  */
#define PPS_RPA10G1R_RPA10G1R_QCS             (PPS_RPA10G1R_RPA10G1R_QCS_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) QCS Position  */
#define PPS_RPA10G1R_RPA10G1R_QD3             (PPS_RPA10G1R_RPA10G1R_QD3_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) QD3 Position  */
#define PPS_RPA10G1R_RPA10G1R_QD2             (PPS_RPA10G1R_RPA10G1R_QD2_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) QD2 Position  */
#define PPS_RPA10G1R_RPA10G1R_QD1             (PPS_RPA10G1R_RPA10G1R_QD1_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) QD1 Position  */
#define PPS_RPA10G1R_RPA10G1R_CCLOUT0         (PPS_RPA10G1R_RPA10G1R_CCLOUT0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) CCLOUT0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TSTBUS0         (PPS_RPA10G1R_RPA10G1R_TSTBUS0_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TSTBUS0 Position  */
#define PPS_RPA10G1R_RPA10G1R_TSTBUS4         (PPS_RPA10G1R_RPA10G1R_TSTBUS4_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TSTBUS4 Position  */
#define PPS_RPA10G1R_RPA10G1R_TSTBUS8         (PPS_RPA10G1R_RPA10G1R_TSTBUS8_Val << PPS_RPA10G1R_RPA10G1R_Pos) /* (PPS_RPA10G1R) TSTBUS8 Position  */
#define PPS_RPA10G1R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_RPA10G1R) Register Mask  */


/* -------- PPS_RPA10G4R : (PPS Offset: 0x26C) (R/W 32)  -------- */
#define PPS_RPA10G4R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPA10G4R)   Reset Value */

