Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#define PPS_RPB4G2R_RPB4G2R_Pos               _UINT32_(0)                                          /* (PPS_RPB4G2R) RPB4G2 Position */
#define PPS_RPB4G2R_RPB4G2R_Msk               (_UINT32_(0x1F) << PPS_RPB4G2R_RPB4G2R_Pos)          /* (PPS_RPB4G2R) RPB4G2 Mask */
#define PPS_RPB4G2R_RPB4G2R(value)            (PPS_RPB4G2R_RPB4G2R_Msk & (_UINT32_(value) << PPS_RPB4G2R_RPB4G2R_Pos)) /* Assigment of value for RPB4G2R in the PPS_RPB4G2R register */
#define   PPS_RPB4G2R_RPB4G2R_OFF_Val         _UINT32_(0x0)                                        /* (PPS_RPB4G2R) OFF  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM0P0_Val     _UINT32_(0x1)                                        /* (PPS_RPB4G2R) SERCOM0/PAD0  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM0P3_Val     _UINT32_(0x2)                                        /* (PPS_RPB4G2R) SERCOM0/PAD3  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM0P2_Val     _UINT32_(0x3)                                        /* (PPS_RPB4G2R) SERCOM0/PAD2  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM1P1_Val     _UINT32_(0x4)                                        /* (PPS_RPB4G2R) SERCOM1/PAD1  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM1P3_Val     _UINT32_(0x5)                                        /* (PPS_RPB4G2R) SERCOM1/PAD3  */
#define   PPS_RPB4G2R_RPB4G2R_SCOM1P2_Val     _UINT32_(0x6)                                        /* (PPS_RPB4G2R) SERCOM1/PAD2  */
#define   PPS_RPB4G2R_RPB4G2R_TCC0WO1_Val     _UINT32_(0xB)                                        /* (PPS_RPB4G2R) TCC0/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_TCC0WO5_Val     _UINT32_(0xC)                                        /* (PPS_RPB4G2R) TCC0/WO5  */
#define   PPS_RPB4G2R_RPB4G2R_TCC0WO3_Val     _UINT32_(0xD)                                        /* (PPS_RPB4G2R) TCC0/WO3  */
#define   PPS_RPB4G2R_RPB4G2R_TCC1WO1_Val     _UINT32_(0xE)                                        /* (PPS_RPB4G2R) TCC1/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_TCC1WO5_Val     _UINT32_(0xF)                                        /* (PPS_RPB4G2R) TCC1/WO5  */
#define   PPS_RPB4G2R_RPB4G2R_TCC1WO3_Val     _UINT32_(0x10)                                       /* (PPS_RPB4G2R) TCC1/WO3  */
#define   PPS_RPB4G2R_RPB4G2R_TCC2WO1_Val     _UINT32_(0x11)                                       /* (PPS_RPB4G2R) TCC2/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_TC0WO1_Val      _UINT32_(0x12)                                       /* (PPS_RPB4G2R) TC0/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_REFO2_Val       _UINT32_(0x13)                                       /* (PPS_RPB4G2R) REFO2  */
#define   PPS_RPB4G2R_RPB4G2R_TC1WO1_Val      _UINT32_(0x14)                                       /* (PPS_RPB4G2R) TC1/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_TC2WO1_Val      _UINT32_(0x15)                                       /* (PPS_RPB4G2R) TC2/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_TC3WO1_Val      _UINT32_(0x16)                                       /* (PPS_RPB4G2R) TC3/WO1  */
#define   PPS_RPB4G2R_RPB4G2R_QSCK_Val        _UINT32_(0x17)                                       /* (PPS_RPB4G2R) QSCK  */
#define   PPS_RPB4G2R_RPB4G2R_QCS_Val         _UINT32_(0x18)                                       /* (PPS_RPB4G2R) QCS  */
#define   PPS_RPB4G2R_RPB4G2R_QD0_Val         _UINT32_(0x19)                                       /* (PPS_RPB4G2R) QD0  */
#define   PPS_RPB4G2R_RPB4G2R_QD3_Val         _UINT32_(0x1A)                                       /* (PPS_RPB4G2R) QD3  */
#define   PPS_RPB4G2R_RPB4G2R_QD2_Val         _UINT32_(0x1B)                                       /* (PPS_RPB4G2R) QD2  */
#define   PPS_RPB4G2R_RPB4G2R_CCLOUT1_Val     _UINT32_(0x1C)                                       /* (PPS_RPB4G2R) CCLOUT1  */
#define   PPS_RPB4G2R_RPB4G2R_TSTBUS1_Val     _UINT32_(0x1D)                                       /* (PPS_RPB4G2R) TSTBUS1  */
#define   PPS_RPB4G2R_RPB4G2R_TSTBUS5_Val     _UINT32_(0x1E)                                       /* (PPS_RPB4G2R) TSTBUS5  */
#define   PPS_RPB4G2R_RPB4G2R_TSTBUS9_Val     _UINT32_(0x1F)                                       /* (PPS_RPB4G2R) TSTBUS9  */
#define PPS_RPB4G2R_RPB4G2R_OFF               (PPS_RPB4G2R_RPB4G2R_OFF_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) OFF Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM0P0           (PPS_RPB4G2R_RPB4G2R_SCOM0P0_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM0/PAD0 Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM0P3           (PPS_RPB4G2R_RPB4G2R_SCOM0P3_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM0/PAD3 Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM0P2           (PPS_RPB4G2R_RPB4G2R_SCOM0P2_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM0/PAD2 Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM1P1           (PPS_RPB4G2R_RPB4G2R_SCOM1P1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM1/PAD1 Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM1P3           (PPS_RPB4G2R_RPB4G2R_SCOM1P3_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM1/PAD3 Position  */
#define PPS_RPB4G2R_RPB4G2R_SCOM1P2           (PPS_RPB4G2R_RPB4G2R_SCOM1P2_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) SERCOM1/PAD2 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC0WO1           (PPS_RPB4G2R_RPB4G2R_TCC0WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC0/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC0WO5           (PPS_RPB4G2R_RPB4G2R_TCC0WO5_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC0/WO5 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC0WO3           (PPS_RPB4G2R_RPB4G2R_TCC0WO3_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC0/WO3 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC1WO1           (PPS_RPB4G2R_RPB4G2R_TCC1WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC1/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC1WO5           (PPS_RPB4G2R_RPB4G2R_TCC1WO5_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC1/WO5 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC1WO3           (PPS_RPB4G2R_RPB4G2R_TCC1WO3_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC1/WO3 Position  */
#define PPS_RPB4G2R_RPB4G2R_TCC2WO1           (PPS_RPB4G2R_RPB4G2R_TCC2WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TCC2/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TC0WO1            (PPS_RPB4G2R_RPB4G2R_TC0WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TC0/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_REFO2             (PPS_RPB4G2R_RPB4G2R_REFO2_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) REFO2 Position  */
#define PPS_RPB4G2R_RPB4G2R_TC1WO1            (PPS_RPB4G2R_RPB4G2R_TC1WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TC1/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TC2WO1            (PPS_RPB4G2R_RPB4G2R_TC2WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TC2/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TC3WO1            (PPS_RPB4G2R_RPB4G2R_TC3WO1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TC3/WO1 Position  */
#define PPS_RPB4G2R_RPB4G2R_QSCK              (PPS_RPB4G2R_RPB4G2R_QSCK_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) QSCK Position  */
#define PPS_RPB4G2R_RPB4G2R_QCS               (PPS_RPB4G2R_RPB4G2R_QCS_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) QCS Position  */
#define PPS_RPB4G2R_RPB4G2R_QD0               (PPS_RPB4G2R_RPB4G2R_QD0_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) QD0 Position  */
#define PPS_RPB4G2R_RPB4G2R_QD3               (PPS_RPB4G2R_RPB4G2R_QD3_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) QD3 Position  */
#define PPS_RPB4G2R_RPB4G2R_QD2               (PPS_RPB4G2R_RPB4G2R_QD2_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) QD2 Position  */
#define PPS_RPB4G2R_RPB4G2R_CCLOUT1           (PPS_RPB4G2R_RPB4G2R_CCLOUT1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) CCLOUT1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TSTBUS1           (PPS_RPB4G2R_RPB4G2R_TSTBUS1_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TSTBUS1 Position  */
#define PPS_RPB4G2R_RPB4G2R_TSTBUS5           (PPS_RPB4G2R_RPB4G2R_TSTBUS5_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TSTBUS5 Position  */
#define PPS_RPB4G2R_RPB4G2R_TSTBUS9           (PPS_RPB4G2R_RPB4G2R_TSTBUS9_Val << PPS_RPB4G2R_RPB4G2R_Pos) /* (PPS_RPB4G2R) TSTBUS9 Position  */
#define PPS_RPB4G2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_RPB4G2R) Register Mask  */


