Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pps.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PPS register API structure */
typedef struct
{  /* 'PPS */
  __IO  uint32_t                       PPS_EXTINT0R;       /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT1R;       /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT2R;       /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       PPS_EXTINT3R;       /**< Offset: 0x0C (R/W  32)  */
  __I   uint8_t                        Reserved1[0x2C];
  __IO  uint32_t                       PPS_NMIR;           /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P0R;       /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P1R;       /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P2R;       /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM0P3R;       /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P0R;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P1R;       /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P2R;       /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       PPS_SCOM1P3R;       /**< Offset: 0x5C (R/W  32)  */
  __I   uint8_t                        Reserved2[0x20];
  __IO  uint32_t                       PPS_QSCKR;          /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       PPS_QD0R;           /**< Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       PPS_QD1R;           /**< Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       PPS_QD2R;           /**< Offset: 0x8C (R/W  32)  */
  __IO  uint32_t                       PPS_QD3R;           /**< Offset: 0x90 (R/W  32)  */
  __IO  uint32_t                       PPS_REFIR;          /**< Offset: 0x94 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN0R;        /**< Offset: 0x98 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN1R;        /**< Offset: 0x9C (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN2R;        /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN3R;        /**< Offset: 0xA4 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN4R;        /**< Offset: 0xA8 (R/W  32)  */
  __IO  uint32_t                       PPS_CCLIN5R;        /**< Offset: 0xAC (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO0G1R;      /**< Offset: 0xB0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO0G2R;      /**< Offset: 0xB4 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO1G3R;      /**< Offset: 0xB8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC0WO1G4R;      /**< Offset: 0xBC (R/W  32)  */
  __IO  uint32_t                       PPS_TC1WO0G1R;      /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC1WO1G2R;      /**< Offset: 0xC4 (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO0G1R;      /**< Offset: 0xC8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO0G3R;      /**< Offset: 0xCC (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO1G2R;      /**< Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC2WO1G4R;      /**< Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO0G1R;      /**< Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO0G3R;      /**< Offset: 0xDC (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO1G2R;      /**< Offset: 0xE0 (R/W  32)  */
  __IO  uint32_t                       PPS_TC3WO1G4R;      /**< Offset: 0xE4 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x130];
  __IO  uint32_t                       PPS_RPA3G1R;        /**< Offset: 0x218 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G2R;        /**< Offset: 0x21C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA3G3R;        /**< Offset: 0x220 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G2R;        /**< Offset: 0x224 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G3R;        /**< Offset: 0x228 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA4G4R;        /**< Offset: 0x22C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G1R;        /**< Offset: 0x230 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G3R;        /**< Offset: 0x234 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA5G4R;        /**< Offset: 0x238 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G1R;        /**< Offset: 0x23C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G2R;        /**< Offset: 0x240 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA6G4R;        /**< Offset: 0x244 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA7G1R;        /**< Offset: 0x248 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA7G2R;        /**< Offset: 0x24C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G2R;        /**< Offset: 0x250 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G3R;        /**< Offset: 0x254 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA8G4R;        /**< Offset: 0x258 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G1R;        /**< Offset: 0x25C (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G3R;        /**< Offset: 0x260 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA9G4R;        /**< Offset: 0x264 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA10G1R;       /**< Offset: 0x268 (R/W  32)  */
  __IO  uint32_t                       PPS_RPA10G4R;       /**< Offset: 0x26C (R/W  32)  */
  __I   uint8_t                        Reserved4[0x3C];
  __IO  uint32_t                       PPS_RPB4G1R;        /**< Offset: 0x2AC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB4G2R;        /**< Offset: 0x2B0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB5G2R;        /**< Offset: 0x2B4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB5G3R;        /**< Offset: 0x2B8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G3R;        /**< Offset: 0x2BC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB6G4R;        /**< Offset: 0x2C0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB7G1R;        /**< Offset: 0x2C4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB7G4R;        /**< Offset: 0x2C8 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G1R;        /**< Offset: 0x2CC (R/W  32)  */
  __IO  uint32_t                       PPS_RPB8G2R;        /**< Offset: 0x2D0 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB9G2R;        /**< Offset: 0x2D4 (R/W  32)  */
  __IO  uint32_t                       PPS_RPB9G3R;        /**< Offset: 0x2D8 (R/W  32)  */
} pps_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_PPS_COMPONENT_H_ */
